BirdBare/STM32F7x7-Peripheral-Drivers/bare/CORE/src/STM32F767_LPTIM.c
//
//
//
//
//



#include "STM32F767_LPTIM.h"
#include "STM32F767_RCC.h"

struct LPTIMxo
	LPTIM1o = {&RCC->APB1ENR,9,0,0,LPTIM1};






int LPTIM_Config(struct LPTIMxo * LPTIMo, int IER, int CFGR)
{
	volatile LPTIM_TypeDef * const LPTIMx = LPTIMo->LPTIMx;

	if((LPTIMx->CR & LPTIM_CR_ENABLE) == 0)
	{
		LPTIMx->IER = IER;
		LPTIMx->CFGR = CFGR;

		return 0;
	}
	return LPTIM_CONFIG_ENABLED;
}

int LPTIM_ResetConfig(struct LPTIMxo * LPTIMo)
{
	if((LPTIMo->LPTIMx->CR & LPTIM_CR_ENABLE) == 0)
	{
		RCC_Reset(LPTIMo);

		return 0;
	}
	return LPTIM_CONFIG_ENABLED;	
}

int LPTIM_Enable(struct LPTIMxo * LPTIMo)
{
	LPTIMo->LPTIMx->CR |= LPTIM_CR_ENABLE;
	return 0;
}


int LPTIM_Disable(struct LPTIMxo * LPTIMo)
{
	LPTIMo->LPTIMx->CR = 0; //set ENABLE to zero by setting whole reg to zero
	return 0;
}

void LPTIM_StartSingle(struct LPTIMxo * LPTIMo)
{
	LPTIMo->LPTIMx->CR = LPTIM_CR_ENABLE | LPTIM_CR_SNGSTRT;
}

void LPTIM_StartContinuous(struct LPTIMxo * LPTIMo)
{
	LPTIMo->LPTIMx->CR = LPTIM_CR_ENABLE | LPTIM_CR_CNTSTRT;
}






